1mem/bef/ab_full_log.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      1
Time taken for tests:   0.636 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      259 bytes
HTML transferred:       61 bytes
Requests per second:    1.57 [#/sec] (mean)
Time per request:       635.972 [ms] (mean)
Time per request:       635.972 [ms] (mean, across all concurrent requests)
Transfer rate:          0.40 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      323  323   0.0    323     323
Processing:   313  313   0.0    313     313
Waiting:      313  313   0.0    313     313
Total:        636  636   0.0    636     636
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        64 bytes

Concurrency Level:      1
Time taken for tests:   0.484 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      262 bytes
HTML transferred:       64 bytes
Requests per second:    2.06 [#/sec] (mean)
Time per request:       484.421 [ms] (mean)
Time per request:       484.421 [ms] (mean, across all concurrent requests)
Transfer rate:          0.53 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      241  241   0.0    241     241
Processing:   243  243   0.0    243     243
Waiting:      243  243   0.0    243     243
Total:        484  484   0.0    484     484
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      1
Time taken for tests:   0.461 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      259 bytes
HTML transferred:       61 bytes
Requests per second:    2.17 [#/sec] (mean)
Time per request:       460.872 [ms] (mean)
Time per request:       460.872 [ms] (mean, across all concurrent requests)
Transfer rate:          0.55 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      228  228   0.0    228     228
Processing:   233  233   0.0    233     233
Waiting:      233  233   0.0    233     233
Total:        461  461   0.0    461     461
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   25.697 seconds
Complete requests:      100
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Total transferred:      25903 bytes
HTML transferred:       6103 bytes
Requests per second:    3.89 [#/sec] (mean)
Time per request:       2569.698 [ms] (mean)
Time per request:       256.970 [ms] (mean, across all concurrent requests)
Transfer rate:          0.98 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      218  252  55.0    241     653
Processing:   223 2167 461.7   2173    2818
Waiting:      222 1614 591.3   1710    2818
Total:        442 2419 471.4   2412    3069

Percentage of the requests served within a certain time (ms)
  50%   2412
  66%   2487
  75%   2559
  80%   2800
  90%   2956
  95%   3008
  98%   3058
  99%   3069
 100%   3069 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   25.354 seconds
Complete requests:      100
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Total transferred:      25903 bytes
HTML transferred:       6103 bytes
Requests per second:    3.94 [#/sec] (mean)
Time per request:       2535.379 [ms] (mean)
Time per request:       253.538 [ms] (mean, across all concurrent requests)
Transfer rate:          1.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      220  248  29.8    244     502
Processing:   228 2130 429.0   2218    3391
Waiting:      228 1670 490.4   1734    2510
Total:        449 2378 429.9   2461    3656

Percentage of the requests served within a certain time (ms)
  50%   2461
  66%   2482
  75%   2496
  80%   2505
  90%   2677
  95%   2739
  98%   2765
  99%   3656
 100%   3656 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   27.226 seconds
Complete requests:      100
Failed requests:        2
   (Connect: 0, Receive: 0, Length: 2, Exceptions: 0)
Total transferred:      25906 bytes
HTML transferred:       6106 bytes
Requests per second:    3.67 [#/sec] (mean)
Time per request:       2722.552 [ms] (mean)
Time per request:       272.255 [ms] (mean, across all concurrent requests)
Transfer rate:          0.93 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      222  267 173.2    244    1959
Processing:   235 2302 699.2   2203    4243
Waiting:      235 1224 702.7   1213    4243
Total:        473 2569 727.8   2450    4517

Percentage of the requests served within a certain time (ms)
  50%   2450
  66%   2496
  75%   2683
  80%   2709
  90%   4198
  95%   4321
  98%   4487
  99%   4517
 100%   4517 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      1
Time taken for tests:   0.494 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      259 bytes
HTML transferred:       61 bytes
Requests per second:    2.02 [#/sec] (mean)
Time per request:       493.999 [ms] (mean)
Time per request:       493.999 [ms] (mean, across all concurrent requests)
Transfer rate:          0.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      246  246   0.0    246     246
Processing:   248  248   0.0    248     248
Waiting:      245  245   0.0    245     245
Total:        494  494   0.0    494     494
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      1
Time taken for tests:   0.523 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      259 bytes
HTML transferred:       61 bytes
Requests per second:    1.91 [#/sec] (mean)
Time per request:       523.471 [ms] (mean)
Time per request:       523.471 [ms] (mean, across all concurrent requests)
Transfer rate:          0.48 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      267  267   0.0    267     267
Processing:   256  256   0.0    256     256
Waiting:      256  256   0.0    256     256
Total:        523  523   0.0    523     523
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      1
Time taken for tests:   0.508 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      259 bytes
HTML transferred:       61 bytes
Requests per second:    1.97 [#/sec] (mean)
Time per request:       507.755 [ms] (mean)
Time per request:       507.755 [ms] (mean, across all concurrent requests)
Transfer rate:          0.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      235  235   0.0    235     235
Processing:   273  273   0.0    273     273
Waiting:      273  273   0.0    273     273
Total:        508  508   0.0    508     508
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   24.886 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      25900 bytes
HTML transferred:       6100 bytes
Requests per second:    4.02 [#/sec] (mean)
Time per request:       2488.613 [ms] (mean)
Time per request:       248.861 [ms] (mean, across all concurrent requests)
Transfer rate:          1.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      222  243  10.6    243     270
Processing:   251 2089 392.3   2188    2451
Waiting:      232 1239 601.3   1228    2248
Total:        473 2333 393.5   2431    2692

Percentage of the requests served within a certain time (ms)
  50%   2431
  66%   2463
  75%   2472
  80%   2486
  90%   2494
  95%   2517
  98%   2547
  99%   2692
 100%   2692 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   25.504 seconds
Complete requests:      100
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Total transferred:      25903 bytes
HTML transferred:       6103 bytes
Requests per second:    3.92 [#/sec] (mean)
Time per request:       2550.428 [ms] (mean)
Time per request:       255.043 [ms] (mean, across all concurrent requests)
Transfer rate:          0.99 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      222  249  10.1    250     276
Processing:   263 2136 392.6   2228    2596
Waiting:      243 1266 632.9   1235    2323
Total:        515 2385 391.6   2473    2863

Percentage of the requests served within a certain time (ms)
  50%   2473
  66%   2501
  75%   2512
  80%   2525
  90%   2556
  95%   2575
  98%   2579
  99%   2863
 100%   2863 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   25.166 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      25900 bytes
HTML transferred:       6100 bytes
Requests per second:    3.97 [#/sec] (mean)
Time per request:       2516.609 [ms] (mean)
Time per request:       251.661 [ms] (mean, across all concurrent requests)
Transfer rate:          1.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      220  246  13.1    246     313
Processing:   246 2102 392.7   2206    2590
Waiting:      245 1664 473.0   1729    2271
Total:        490 2348 393.8   2448    2904

Percentage of the requests served within a certain time (ms)
  50%   2448
  66%   2465
  75%   2479
  80%   2490
  90%   2516
  95%   2522
  98%   2539
  99%   2904
 100%   2904 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      1
Time taken for tests:   0.525 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      259 bytes
HTML transferred:       61 bytes
Requests per second:    1.91 [#/sec] (mean)
Time per request:       524.625 [ms] (mean)
Time per request:       524.625 [ms] (mean, across all concurrent requests)
Transfer rate:          0.48 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      251  251   0.0    251     251
Processing:   273  273   0.0    273     273
Waiting:      273  273   0.0    273     273
Total:        525  525   0.0    525     525
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      1
Time taken for tests:   0.515 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      259 bytes
HTML transferred:       61 bytes
Requests per second:    1.94 [#/sec] (mean)
Time per request:       515.016 [ms] (mean)
Time per request:       515.016 [ms] (mean, across all concurrent requests)
Transfer rate:          0.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      256  256   0.0    256     256
Processing:   259  259   0.0    259     259
Waiting:      259  259   0.0    259     259
Total:        515  515   0.0    515     515
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      1
Time taken for tests:   0.466 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      259 bytes
HTML transferred:       61 bytes
Requests per second:    2.15 [#/sec] (mean)
Time per request:       466.157 [ms] (mean)
Time per request:       466.157 [ms] (mean, across all concurrent requests)
Transfer rate:          0.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      232  232   0.0    232     232
Processing:   234  234   0.0    234     234
Waiting:      233  233   0.0    233     233
Total:        466  466   0.0    466     466
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   25.038 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      25900 bytes
HTML transferred:       6100 bytes
Requests per second:    3.99 [#/sec] (mean)
Time per request:       2503.764 [ms] (mean)
Time per request:       250.376 [ms] (mean, across all concurrent requests)
Transfer rate:          1.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      215  245  12.5    244     293
Processing:   249 2102 384.3   2213    2407
Waiting:      234 1555 548.4   1703    2256
Total:        518 2346 383.0   2458    2636

Percentage of the requests served within a certain time (ms)
  50%   2458
  66%   2478
  75%   2484
  80%   2487
  90%   2494
  95%   2499
  98%   2523
  99%   2636
 100%   2636 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   25.373 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      25900 bytes
HTML transferred:       6100 bytes
Requests per second:    3.94 [#/sec] (mean)
Time per request:       2537.306 [ms] (mean)
Time per request:       253.731 [ms] (mean, across all concurrent requests)
Transfer rate:          1.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      222  248  12.5    248     283
Processing:   259 2135 397.1   2238    2437
Waiting:      229 1251 617.1   1245    2304
Total:        520 2384 397.8   2487    2666

Percentage of the requests served within a certain time (ms)
  50%   2487
  66%   2510
  75%   2523
  80%   2532
  90%   2549
  95%   2577
  98%   2599
  99%   2666
 100%   2666 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov2-46626804.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   24.743 seconds
Complete requests:      100
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Total transferred:      25903 bytes
HTML transferred:       6103 bytes
Requests per second:    4.04 [#/sec] (mean)
Time per request:       2474.347 [ms] (mean)
Time per request:       247.435 [ms] (mean, across all concurrent requests)
Transfer rate:          1.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      214  242   9.7    242     270
Processing:   245 2077 382.6   2173    2447
Waiting:      242 1340 583.0   1426    2213
Total:        486 2319 381.4   2419    2682

Percentage of the requests served within a certain time (ms)
  50%   2419
  66%   2433
  75%   2444
  80%   2448
  90%   2463
  95%   2476
  98%   2490
  99%   2682
 100%   2682 (longest request)